app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new_book= Book.new
    @book = Book.find(params[:id])

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "nknknk"], ["body", "knknnk"], ["user_id", 1], ["created_at", "2022-02-08 17:58:19.807940"], ["updated_at", "2022-02-08 17:58:19.807940"]]
---
  def create
    @new_book = Book.new(book_params)
    @new_book.user_id=current_user.id
    if @new_book.save